HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
/*
 * sdio_host - SDHI host bring-up. See sdio_host.h.
 *
 * Ported (polled subset) from the perf project's SDHI command/data path; the
 * scope_pulse / status-LED / Tracealyzer / probe-text instrumentation is left
 * out. Command and data completion are polled directly from SDSTS1/SDSTS2 - no
 * SDHI ISR is registered.
 *
 * The CMD53 byte-mode data phase works once the Broadcom backplane clocks are
 * *forced* on (FORCE_ALP / WAKEUPCTRL / FORCE_HT - see sdio_host_brcm_force_
 * clocks). Requesting ALP alone sets the ALP_AVAIL status bit but does not run
 * the backplane data clock, so the card ACKs CMD53 yet never clocks data into
 * the SDHI buffer (SDSTS2 stuck at CBSY, SDSTS2.RE never asserts). Verified
 * byte-for-byte against a known-good perf run on this bench.
 */
#include <stdint.h>
#include <stdbool.h>

#include "platform.h"
#include "r_sdhi_rx_if.h"
#include "r_sdhi_rx_pinset.h"
#include "r_sdio_rx_if.h"
#include "sdio_host.h"

#define SDIO_HOST_CMD53_BLOCK_TRANSFER_CPU   (0)
#define SDIO_HOST_CMD53_BLOCK_TRANSFER_DMACA (1)
#define SDIO_HOST_CMD53_BLOCK_TRANSFER_DTC   (2)

#ifndef SDIO_HOST_CMD53_BLOCK_TRANSFER
#define SDIO_HOST_CMD53_BLOCK_TRANSFER       SDIO_HOST_CMD53_BLOCK_TRANSFER_CPU
#endif

#ifndef SDIO_HOST_DMACA_CHANNEL
#define SDIO_HOST_DMACA_CHANNEL              DMACA_CH0
#endif

#ifndef SDIO_HOST_DMACA_TIMEOUT
#define SDIO_HOST_DMACA_TIMEOUT              (1000000UL)
#endif

#if (SDIO_HOST_CMD53_BLOCK_TRANSFER == SDIO_HOST_CMD53_BLOCK_TRANSFER_DMACA)
#include "r_dmaca_rx_if.h"
#endif

/* SDHI command-word fields not exported by r_sdhi_rx_if.h (local in the perf
 * project too). */
#define SDHI_CMDIDX_MASK        (0x3fU)
#define SDHI_SDCMD_RSP_NONE     (3U << 8)         /* no response (CMD0)        */
#define SDHI_SDCMD_RSP_R1_R5_R6_R7 (4U << 8)      /* 48-bit short (CMD52 = R5) */
#define SDHI_SDCMD_RSP_R3_R4    (7U << 8)         /* 32-bit no-CRC (CMD5)      */
#define SDHI_SDSTS1_RSPEND      (0x0001U)         /* response end              */
#define SDHI_SDSTS1_ACEND       (0x0004U)         /* command (access) end      */
#define SDHI_SDSTS2_ERR_BITS    (0x807fU)         /* all SDSTS2 error bits      */
#define SDHI_CMD_TIMEOUT        (4000000UL)       /* polling budget per wait   */
#define SDIO_R4_OCR_MASK        (0x00ffffffUL)    /* OCR voltage window in R4  */

/* CMD53 command words (index 53 = 0x35 plus the data-enable / direction bits
 * the perf project uses). Local to the perf project too; not exported by
 * r_sdhi_rx_if.h. */
#define SDHI_CMD53_SINGLE_READ  (0x1c35UL)        /* CMD53 single read         */
#define SDHI_CMD53_SINGLE_WRITE (0x0c35UL)        /* CMD53 single write        */
#define SDHI_CMD53_BLOCK_READ   (0x7c35UL)        /* CMD53 multi-block read     */
#define SDHI_CMD53_BLOCK_WRITE  (0x6c35UL)        /* CMD53 multi-block write    */

/* Block-mode read CRC handling: the CYW43439 backplane returns valid data with
 * a read-CRC error flagged; perf tolerates it (relaxed CRC). */
#define SDHI_SDSTS2_READ_CRC_ERR (SDHI_SDIMSK2_ERR1)  /* read CRC error in SDSTS2 */
#define SDHI_SDSTS2_ILLEGAL_READ_ERR (SDHI_SDIMSK2_ERR5) /* illegal SDBUFR read */
#define SDHI_SDERSTS1_RDCRCE    (0x0400U)         /* read-data CRC error (SDERSTS1) */
#define SDHI_SDSTS1_DETECT_BITS (0x0318U)         /* DAT3/CD detect latch bits  */

/* CCCR bus interface control (F0 reg 0x07) fields for the 4-bit switch. */
#define SDIO_CCCR_BUS_IF_CONTROL (0x07UL)         /* CCCR bus interface control */
#define SDIO_BUS_WIDTH_MASK     (0x03U)           /* bus width field           */
#define SDIO_BUS_WIDTH_4BIT     (0x02U)           /* 4-bit bus                 */
#define SDIO_BUS_CD_DISABLE     (0x80U)           /* disable DAT3 CD pull-up   */

/* Broadcom force-HT and WAKEUPCTRL bits (the header carries only the ALP /
 * FORCE_ALP set). perf FORCEs the clocks (not just requests ALP) before the
 * first CMD53 backplane read. */
#define SDIO_BRCM_FORCE_HT          (0x02U)       /* force the HT clock        */
#define SDIO_BRCM_WCTRL_WAKE_TILL_HT (0x02U)      /* WAKEUPCTRL: wake till HT  */
#define SDIO_BRCM_HT_AVAIL          (0x80U)       /* HT clock available (CSR)  */

/* Broadcom SLEEPCSR (F1 0x1001f) bit: keep the WLAN SDIO core on (KSO). */
#define SDIO_BRCM_SLPCSR_KEEP_WL_KSO (0x01U)

/* Broadcom backplane core addresses for the firmware-download bring-up
 * (CYW43439). The ARM (WLAN CPU) and SOCRAM cores are controlled through their
 * AI wrapper (core base + 0x100000); the firmware/RAM lives at RAM base 0. */
#define BRCM_RAM_BASE              (0x00000000UL) /* SOCRAM/firmware RAM base   */
#define BRCM_SDIOD_CORE_BASE       (0x18002000UL)
#define BRCM_ARM_CORE_BASE         (0x18003000UL)
#define BRCM_SOCSRAM_BASE          (0x18004000UL)
#define BRCM_WRAPPER_OFFSET        (0x00100000UL)
#define BRCM_ARM_WRAP_BASE         (BRCM_ARM_CORE_BASE + BRCM_WRAPPER_OFFSET)    /* 0x18103000 */
#define BRCM_SOCRAM_WRAP_BASE      (BRCM_SOCSRAM_BASE + BRCM_WRAPPER_OFFSET)     /* 0x18104000 */
#define BRCM_AI_IOCTRL_OFFSET      (0x408UL)      /* core ioctrl in wrapper     */
#define BRCM_AI_RESETCTRL_OFFSET   (0x800UL)      /* core reset ctrl in wrapper */
#define BRCM_SICF_FGC              (0x02U)        /* force gated clocks         */
#define BRCM_SICF_CLOCK_EN         (0x01U)        /* clock enable               */
#define BRCM_AIRC_RESET            (0x01U)        /* core in reset              */
#define BRCM_SOCSRAM_BANKX_INDEX   (BRCM_SOCSRAM_BASE + 0x10UL)
#define BRCM_SOCSRAM_BANKX_PDA     (BRCM_SOCSRAM_BASE + 0x44UL)

/* Firmware/NVRAM blobs, loaded into MCU flash at runtime via J-Link (kept out
 * of the repo per project policy). The download streams them into SOCRAM. */
#define SDIO_FW_BLOB_ADDR          (0xFFF00000UL) /* 43439A0.bin in flash       */
#define SDIO_FW_BLOB_SIZE          (249066UL)
#define SDIO_NVRAM_IMAGE_ADDR      (0xFFF80000UL) /* nvram_1yn.bin in flash      */
#define SDIO_NVRAM_IMAGE_SIZE      (816UL)
#define SDIO_FW_BLOCK_SIZE         (64UL)         /* F1 block size for the stream */
#define SDIO_BRCM_FUNC1_FRAMECTRL  (0x0001000dUL) /* F1 frame control            */
#define SDIO_CCCR_IO_ABORT         (0x06UL)       /* CCCR IO abort (F0)          */
#define SDIO_CCCR_IO_READY_FN2     (0x04U)        /* F2 ready bit in IO_READY    */
#define SDIO_CCCR_IO_ENABLE_FN2    (0x04U)        /* F2 enable bit in IO_ENABLE  */

