HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
static bool sdhi_can_read_crc_error_block(uint32_t sdsts2);
static bool sdhi_can_accept_read_done_error(uint32_t sdsts1, uint32_t sdsts2);

/*
 * EK-RX671 SD slot power enable. P51 drives the +3V3_SD power switch. Cycle it
 * off (1 s) then on (settle 500 ms) so the card boots from a clean power state
 * - the perf project's sd_slot_power_on() sequence. Without this the card is
 * unpowered and never answers CMD5.
 */
static void sd_slot_power_on(void)
{
    PORT5.PMR.BIT.B1 = 0U;     /* P51 as GPIO */
    PORT5.PDR.BIT.B1 = 1U;     /* output      */
    PORT5.PODR.BIT.B1 = 0U;    /* power off   */
    R_BSP_SoftwareDelay(1000U, BSP_DELAY_MILLISECS);
    PORT5.PODR.BIT.B1 = 1U;    /* power on    */
    R_BSP_SoftwareDelay(500U, BSP_DELAY_MILLISECS);
}

static uint32_t sdhi_make_cmd(uint8_t index, uint32_t response)
{
    return ((uint32_t)index & SDHI_CMDIDX_MASK) | response;
}

/* Wait until the command buffer is free (SDSTS2.CBSY == 0). */
static bool sdhi_wait_command_ready(void)
{
    uint32_t timeout = SDHI_CMD_TIMEOUT;
    uint32_t sdsts2 = 0U;

    while (0UL != timeout)
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &sdsts2);
        if (0U == (sdsts2 & SDHI_SDIMSK2_CBSY))
        {
            return true;
        }
        timeout--;
    }
    return false;
}

/*
 * Poll SDSTS1/SDSTS2 until the requested bits are set, an error bit appears, or
 * the budget runs out. This single helper serves every command-completion
 * (RSPEND/ACEND) and data-phase (RE/WE/ACEND) wait.
 */
static bool sdhi_wait_status(uint32_t sdsts1_mask, uint32_t sdsts2_mask,
                             uint32_t * p_sdsts1, uint32_t * p_sdsts2)
{
    uint32_t timeout = SDHI_CMD_TIMEOUT;
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    bool s1_ok;
    bool s2_ok;

    while (0UL != timeout)
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, &sdsts1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &sdsts2);
        if (0U != (sdsts2 & SDHI_SDSTS2_ERR_BITS))
        {
            break;
        }
        s1_ok = (0U == sdsts1_mask) || (0U != (sdsts1 & sdsts1_mask));
        s2_ok = (0U == sdsts2_mask) || (0U != (sdsts2 & sdsts2_mask));
        if (s1_ok && s2_ok)
        {
            break;
        }
        timeout--;
    }

    *p_sdsts1 = sdsts1;
    *p_sdsts2 = sdsts2;
    s1_ok = (0U == sdsts1_mask) || (0U != (sdsts1 & sdsts1_mask));
    s2_ok = (0U == sdsts2_mask) || (0U != (sdsts2 & sdsts2_mask));
    return ((0UL != timeout) && (0U == (sdsts2 & SDHI_SDSTS2_ERR_BITS)) && s1_ok && s2_ok);
}

static bool sdhi_issue_command(uint8_t index, uint32_t argument, uint32_t response,
                               bool response_expected, uint32_t * p_sdsts1, uint32_t * p_sdsts2)
{
    uint32_t cmd = sdhi_make_cmd(index, response);

    /* Clear the previous response/command-end and error flags so the wait sees
     * a fresh 0->1 transition. */
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);

    if (!sdhi_wait_command_ready())
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, p_sdsts1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, p_sdsts2);
        return false;
    }

    /* Writing SDCMD after SDARG launches the command. */
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDARG, argument);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDCMD, cmd);

    return sdhi_wait_status(response_expected ? SDHI_SDSTS1_RSPEND : SDHI_SDSTS1_ACEND, 0U,
                            p_sdsts1, p_sdsts2);
}

bool sdio_host_init(void)
{
    uint32_t sdclkcr = 0U;

    /* Power the SD slot before touching the SDHI peripheral. */
    sd_slot_power_on();

    R_SDHI_PinSetInit();

    if (SDHI_SUCCESS != R_SDHI_Open(SDHI_CH0))
    {
        return false;
    }

    (void)R_SDHI_SetBus(SDHI_CH0, SDHI_PORT_1BIT);
    R_SDHI_PinSetTransfer();

    /* ~400 kHz identification clock. */
    if (SDHI_SUCCESS != R_SDHI_SetClock(SDHI_CH0, SDHI_DIV_256, SDHI_CLOCK_ENABLE))
    {
        return false;
    }

    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDCLKCR, &sdclkcr);
    return (0U != (sdclkcr & SDHI_CLOCK_MASK_SCLKEN));
}

bool sdio_host_first_contact(uint32_t * p_r4, uint8_t * p_func_count)
{
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t ocr;
    sdhi_get_resp_t resp = {0};

    if ((NULL == p_r4) || (NULL == p_func_count))
    {
        return false;
    }

    /* CMD0 GO_IDLE: reset the card to the idle state (no response). */
    R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    (void)sdhi_issue_command(0U, 0U, SDHI_SDCMD_RSP_NONE, false, &sdsts1, &sdsts2);
    R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);

    /* CMD5 IO_SEND_OP_COND, first call: OCR = 0 probes the supported voltage
     * window (returned in R4[23:0]). */
    if (!sdhi_issue_command(5U, 0U, SDHI_SDCMD_RSP_R3_R4, true, &sdsts1, &sdsts2))
    {
        return false;
    }
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    ocr = resp.sdrsp10 & SDIO_R4_OCR_MASK;

    /* CMD5 second call: echo the OCR window back to select the voltage range;
     * the card returns R4 with the ready bit (31) and IO function count
     * (30:28). */
    if (!sdhi_issue_command(5U, ocr, SDHI_SDCMD_RSP_R3_R4, true, &sdsts1, &sdsts2))
    {
        return false;
    }
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);

    *p_r4 = resp.sdrsp10;
    *p_func_count = (uint8_t)((resp.sdrsp10 >> 28) & 0x07U);
    return true;
}

bool sdio_host_select_card(uint16_t * p_rca)
{
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint16_t rca;
    sdhi_get_resp_t resp = {0};

    if (NULL == p_rca)
    {
        return false;
    }

    /* CMD3 SEND_RELATIVE_ADDR: the card publishes its RCA in R6[31:16].
     * Response type 0 lets the SDHI controller auto-select the R6 response. */
    if (!sdhi_issue_command(3U, 0U, 0U, true, &sdsts1, &sdsts2))
    {
        return false;
    }
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    rca = (uint16_t)(resp.sdrsp10 >> 16);

    /* CMD7 SELECT_CARD with the RCA: move the addressed card to the transfer
     * state (R1b). */
    if (!sdhi_issue_command(7U, ((uint32_t)rca << 16), 0U, true, &sdsts1, &sdsts2))
    {
        return false;
    }

    *p_rca = rca;
    return true;
}

/* ---- r_sdio_rx protocol layer wiring (increment 3 + 4a + 4b) ---------------
 *
 * r_sdio_rx is a pure protocol layer: it issues CMD52/CMD53 through host
 * callbacks. The CMD52 callback bridges to the polled SDHI command path above;
 * the CMD53 callback drives the data phase (SDSIZE / SDARG / CMD53 -> poll
 * BRE/BWE -> SDBUFR -> ACEND) in both byte mode (increment 4a) and block mode
 * (increment 4b, the firmware-download de-risk gate's transfer primitive). This
 * is the same host the WHD bus backend will sit on. */
static sdio_ctrl_t g_sdio_ctrl;
static sdio_cfg_t  g_sdio_cfg;

/* Host-side CMD52: build the argument, issue it, and return the R5 data byte. */
static bool sdio_cmd52_read(uint8_t function, uint32_t address, uint8_t * p_data, uint32_t * p_r5)
{
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg = R_SDIO_MakeCmd52Arg(false, function, address, false, 0U);
    sdhi_get_resp_t resp = {0};
    bool ok;

