HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    ok = sdhi_issue_command(52U, arg, SDHI_SDCMD_RSP_R1_R5_R6_R7, true, &sdsts1, &sdsts2);
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    *p_r5 = resp.sdrsp10;
    *p_data = (uint8_t)resp.sdrsp10;
    return ok;
}

static bool sdio_cmd52_write_raw(uint8_t function, uint32_t address, uint8_t data, bool raw,
                                 uint8_t * p_readback, uint32_t * p_r5)
{
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg = R_SDIO_MakeCmd52Arg(true, function, address, raw, data);
    sdhi_get_resp_t resp = {0};
    bool ok;

    ok = sdhi_issue_command(52U, arg, SDHI_SDCMD_RSP_R1_R5_R6_R7, true, &sdsts1, &sdsts2);
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    *p_r5 = resp.sdrsp10;
    *p_readback = (uint8_t)resp.sdrsp10;
    return ok;
}

static sdio_err_t sdio_rx_cmd52_callback(void * p_context, sdio_cmd52_t * p_args)
{
    bool ok;
    uint32_t r5 = 0U;
    uint8_t data = 0U;

    (void)p_context;
    if (NULL == p_args)
    {
        return SDIO_ERR_NULL_PTR;
    }

    if (p_args->write)
    {
        ok = sdio_cmd52_write_raw(p_args->function, p_args->address, p_args->write_data, p_args->raw, &data, &r5);
    }
    else
    {
        ok = sdio_cmd52_read(p_args->function, p_args->address, &data, &r5);
    }

    p_args->read_data = data;
    p_args->r5 = r5;
    return ok ? SDIO_SUCCESS : SDIO_ERR_HOST;
}

/* CMD53 byte-path diagnostics (bring-up). g_cmd53_diag_stage marks how far the
 * last read got: 1 = command/R5, 2 = BRE (RE) wait, 3 = ACEND wait, 0xFF =
 * success; stage 0 means CMD53 was never entered. The SDSTS1/SDSTS2/R5 snapshot
 * is captured at the failure point so the UART log can pinpoint a stall. */
static uint8_t  g_cmd53_diag_stage = 0U;
static uint32_t g_cmd53_diag_s1 = 0U;
static uint32_t g_cmd53_diag_s2 = 0U;
static uint32_t g_cmd53_diag_er1 = 0U;
static uint32_t g_cmd53_diag_er2 = 0U;
static uint32_t g_cmd53_diag_r5 = 0U;
static uint32_t g_cmd53_diag_data0 = 0U;

/* Per-function SDIO block size (bytes), set by sdio_host_set_block_size and used
 * by the CMD53 block-mode transfer. */
static uint16_t g_sdio_block_size[SDIO_MAX_FUNCTION + 1U];

#if (SDIO_HOST_CMD53_BLOCK_TRANSFER == SDIO_HOST_CMD53_BLOCK_TRANSFER_DMACA)
static bool g_sdio_dmaca_open;

static bool sdio_cmd53_dmaca_init(void)
{
    dmaca_stat_t stat;
    dmaca_return_t err;

    if (g_sdio_dmaca_open)
    {
        return true;
    }

    R_DMACA_Init();
    err = R_DMACA_Open(SDIO_HOST_DMACA_CHANNEL);
    if (DMACA_SUCCESS != err)
    {
        return false;
    }

    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DISABLE, &stat);
    g_sdio_dmaca_open = true;
    return true;
}

static bool sdio_cmd53_transfer_block_dmaca(bool write, volatile uint32_t * p_sdbufr,
                                            uint8_t * p_data, uint32_t block_size)
{
    dmaca_transfer_data_cfg_t cfg;
    dmaca_stat_t stat;
    dmaca_return_t err;
    uint32_t timeout = SDIO_HOST_DMACA_TIMEOUT;

    if ((0UL != (((uint32_t)p_data) & 0x03UL)) || (0UL != (block_size & 0x03UL)))
    {
        return false;
    }
    if (!sdio_cmd53_dmaca_init())
    {
        return false;
    }

    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DISABLE, &stat);
    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_SOFT_REQ_CLR, &stat);
    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DTIF_STATUS_CLR, &stat);
    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_ESIF_STATUS_CLR, &stat);

    cfg.transfer_mode        = DMACA_TRANSFER_MODE_NORMAL;
    cfg.repeat_block_side    = DMACA_REPEAT_BLOCK_DISABLE;
    cfg.data_size            = DMACA_DATA_SIZE_LWORD;
    cfg.act_source           = (dmaca_activation_source_t)0;
    cfg.request_source       = DMACA_TRANSFER_REQUEST_SOFTWARE;
    cfg.dtie_request         = DMACA_TRANSFER_END_INTERRUPT_DISABLE;
    cfg.esie_request         = DMACA_TRANSFER_ESCAPE_END_INTERRUPT_DISABLE;
    cfg.rptie_request        = DMACA_REPEAT_SIZE_END_INTERRUPT_DISABLE;
    cfg.sarie_request        = DMACA_SRC_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    cfg.darie_request        = DMACA_DES_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    cfg.src_addr_repeat_area = DMACA_SRC_ADDR_EXT_REP_AREA_NONE;
    cfg.des_addr_repeat_area = DMACA_DES_ADDR_EXT_REP_AREA_NONE;
    cfg.offset_value         = 0UL;
    cfg.interrupt_sel        = DMACA_CLEAR_INTERRUPT_FLAG_BEGINNING_TRANSFER;
    cfg.transfer_count       = block_size / 4UL;
    cfg.block_size           = 0U;
    cfg.rsv[0]               = 0U;
    cfg.rsv[1]               = 0U;

    if (write)
    {
        cfg.src_addr_mode = DMACA_SRC_ADDR_INCR;
        cfg.des_addr_mode = DMACA_DES_ADDR_FIXED;
        cfg.p_src_addr    = (void *)p_data;
        cfg.p_des_addr    = (void *)p_sdbufr;
    }
    else
    {
        cfg.src_addr_mode = DMACA_SRC_ADDR_FIXED;
        cfg.des_addr_mode = DMACA_DES_ADDR_INCR;
        cfg.p_src_addr    = (void *)p_sdbufr;
        cfg.p_des_addr    = (void *)p_data;
    }

    err = R_DMACA_Create(SDIO_HOST_DMACA_CHANNEL, &cfg);
    if (DMACA_SUCCESS == err)
    {
        err = R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_ENABLE, &stat);
    }
    if (DMACA_SUCCESS == err)
    {
        err = R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_SOFT_REQ_WITH_AUTO_CLR_REQ, &stat);
    }
    if (DMACA_SUCCESS != err)
    {
        (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DISABLE, &stat);
        return false;
    }

    do
    {
        err = R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_STATUS_GET, &stat);
        if ((DMACA_SUCCESS == err) && (!stat.act_stat) && (0UL == stat.transfer_count))
        {
            (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DISABLE, &stat);
            (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DTIF_STATUS_CLR, &stat);
            return true;
        }
        if ((DMACA_SUCCESS != err) || stat.esif_stat)
        {
            break;
        }
    } while (0UL != --timeout);

    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_DISABLE, &stat);
    (void)R_DMACA_Control(SDIO_HOST_DMACA_CHANNEL, DMACA_CMD_SOFT_REQ_CLR, &stat);
    return false;
}
#endif

static void sdio_cmd53_transfer_block_cpu(bool write, volatile uint32_t * p_sdbufr,
                                          uint8_t * p_data, uint32_t block_size,
                                          uint32_t block_index)
{
    uint32_t byte_index = block_index * block_size;
    uint32_t word_index;
    uint32_t word;

