HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    g_cmd53_diag_stage = 3U;
    ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, &sdsts1, &sdsts2);
    if ((!ok) && sdhi_can_accept_read_done_error(sdsts1, sdsts2))
    {
        ok = true;
    }
    if (!ok)
    {
        sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        sdhi_cmd53_force_stop(&sdsts2);
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND,
                               ok ? (sdsts2 & SDHI_SDSTS2_ERR_BITS) : 0U);
    if (ok)
    {
        g_cmd53_diag_stage = 0xFFU;
    }
    return ok;
}

/*
 * CMD53 byte-mode write: transfer up to 512 bytes from p_data to one IO
 * function. The transmit buffer is fed through the raw SDBUFR address (the
 * controller wants successive writes to the same word port), waiting on
 * SDSTS2.WE for buffer space and SDSTS1.ACEND for completion.
 */
static bool sdio_cmd53_write_bytes(uint8_t function, uint32_t address, bool increment,
                                   uint8_t * p_data, uint32_t length, uint32_t * p_r5)
{
    bool ok;
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg;
    uint32_t word;
    uint32_t byte_index;
    uint32_t word_index;
    uint32_t word_count = (length + 3UL) / 4UL;
    uint32_t buff_reg;
    volatile uint32_t * p_sdbufr;

    if ((0UL == length) || (512UL < length))
    {
        *p_r5 = 0U;
        return false;
    }

    if (SDHI_SUCCESS != R_SDHI_GetBuffRegAddress(SDHI_CH0, &buff_reg))
    {
        *p_r5 = 0U;
        return false;
    }
    p_sdbufr = (volatile uint32_t *)buff_reg;

    arg = R_SDIO_MakeCmd53Arg(true, function, address, increment, false, length);

    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSIZE, length);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);

    ok = sdhi_cmd53_issue(arg, SDHI_CMD53_SINGLE_WRITE, p_r5, &sdsts1, &sdsts2);
    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
        return false;
    }

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_RESP, 0U);

    /* Wait for the transmit buffer to accept data (BWE = SDSTS2.WE). */
    ok = sdhi_wait_status(0U, SDHI_SDIMSK2_WE, &sdsts1, &sdsts2);
    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
        return false;
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U, SDHI_SDIMSK2_WE);

    byte_index = 0UL;
    for (word_index = 0UL; word_index < word_count; word_index++)
    {
        word = 0UL;
        while ((byte_index < length) && (byte_index < ((word_index + 1UL) * 4UL)))
        {
            word |= ((uint32_t)p_data[byte_index]) << ((byte_index & 0x03UL) * 8UL);
            byte_index++;
        }
        p_sdbufr[0] = word;
    }

    ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, &sdsts1, &sdsts2);
    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND, 0U);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    return ok;
}

/* A backplane block read can finish with a read-CRC error flagged while the
 * data in the buffer is still valid (CYW43439 quirk). Treat that one specific
 * condition - buffer-read-ready set, the only SDSTS2 error is the read-CRC bit,
 * and SDERSTS1 confirms RDCRCE - as recoverable, like perf does. */
static bool sdhi_can_read_crc_error_block(uint32_t sdsts2)
{
    uint32_t sdersts1 = 0U;

    if (0U == (sdsts2 & SDHI_SDIMSK2_RE))
    {
        return false;
    }
    if (SDHI_SDSTS2_READ_CRC_ERR != (sdsts2 & SDHI_SDSTS2_ERR_BITS))
    {
        return false;
    }
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS1, &sdersts1);
    return (0U != (sdersts1 & SDHI_SDERSTS1_RDCRCE));
}

/* A byte/block read may finish with ACEND set while SDSTS2 latches ILR after
 * SDBUFR was drained and SDERSTS1 still reports the CYW43439 read-CRC quirk.
 * Accept only that narrow final-state combination; timeouts or command/end
 * errors still fail. */
static bool sdhi_can_accept_read_done_error(uint32_t sdsts1, uint32_t sdsts2)
{
    uint32_t err_bits = sdsts2 & SDHI_SDSTS2_ERR_BITS;
    uint32_t sdersts1 = 0U;
    uint32_t sdersts2 = 0U;

    if (0U == (sdsts1 & SDHI_SDSTS1_ACEND))
    {
        return false;
    }
    if ((SDHI_SDSTS2_ILLEGAL_READ_ERR != err_bits) &&
        ((SDHI_SDSTS2_ILLEGAL_READ_ERR | SDHI_SDSTS2_READ_CRC_ERR) != err_bits))
    {
        return false;
    }

    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS1, &sdersts1);
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS2, &sdersts2);
    return ((0U != (sdersts1 & SDHI_SDERSTS1_RDCRCE)) && (0U == sdersts2));
}

/*
 * CMD53 block-mode transfer (read or write) of block_count blocks of the
 * function's configured block size. SDSIZE = block size, SDBLKCNT = block count,
 * SDSTOP = block-count-enable; the command then runs one block at a time,
 * waiting on SDSTS2.RE/WE per block and SDBUFR for the data, ending on
 * SDSTS1.ACEND. A single-block transfer uses the SINGLE command word (matching
 * perf). Read CRC errors are tolerated (sdhi_can_read_crc_error_block).
 */
static bool sdio_cmd53_transfer_blocks(bool write, uint8_t function, uint32_t address, bool increment,
                                       uint8_t * p_data, uint32_t block_count, uint32_t * p_r5)
{
    bool ok;
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg;
    uint32_t block_index;
    uint32_t clear_mask;
    uint32_t block_size = g_sdio_block_size[function];
    uint32_t length = block_size * block_count;
    uint32_t buff_reg;
    uint32_t ready_mask = write ? SDHI_SDIMSK2_WE : SDHI_SDIMSK2_RE;
    uint32_t cmd;
    bool relaxed_read_crc;
    volatile uint32_t * p_sdbufr;

    if ((function > SDIO_MAX_FUNCTION) || (0UL == block_count) || (511UL < block_count))
    {
        *p_r5 = 0U;
        return false;
    }
    if ((0UL == block_size) || (0UL != (block_size & 0x03UL)) || (0UL == length))
    {
        *p_r5 = 0U;
        return false;
    }
    if (SDHI_SUCCESS != R_SDHI_GetBuffRegAddress(SDHI_CH0, &buff_reg))
    {
        *p_r5 = 0U;
        return false;
    }
    p_sdbufr = (volatile uint32_t *)buff_reg;

    arg = R_SDIO_MakeCmd53Arg(write, function, address, increment, true, block_count);
    /* A single block uses the SINGLE command word; multi-block uses BLOCK. */
    if (1UL == block_count)
    {
        cmd = write ? SDHI_CMD53_SINGLE_WRITE : SDHI_CMD53_SINGLE_READ;
    }
    else
    {
        cmd = write ? SDHI_CMD53_BLOCK_WRITE : SDHI_CMD53_BLOCK_READ;
    }

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_TRNS_RESP | SDHI_SDSTS1_DETECT_BITS,
                               SDHI_SDIMSK2_CLEAR | ready_mask);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSIZE, block_size);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_SEC_ENABLE);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDBLKCNT, block_count);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);

    g_cmd53_diag_stage = 1U;
    g_cmd53_diag_data0 = 0U;
    ok = sdhi_cmd53_issue(arg, cmd, p_r5, &sdsts1, &sdsts2);
    /* A read that the command engine flagged can still carry good data if RSPEND
     * was seen or only a read-CRC error is set. */
    if ((!write) && (!ok))
    {
        uint32_t live1 = 0U;
        uint32_t live2 = 0U;

        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, &live1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &live2);
        if ((0U != (sdsts1 & SDHI_SDSTS1_RSPEND)) || (0U != (live1 & SDHI_SDSTS1_RSPEND)) ||
            sdhi_can_read_crc_error_block(sdsts2))
        {
            sdsts1 = live1;
            sdsts2 = live2;
            ok = true;
        }
    }
    if (!ok)
    {
        sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        sdhi_cmd53_force_stop(&sdsts2);
        (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
        return false;
    }

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_RESP, 0U);

    g_cmd53_diag_stage = 2U;
    for (block_index = 0UL; block_index < block_count; block_index++)
    {
        ok = sdhi_wait_status(0U, ready_mask, &sdsts1, &sdsts2);
        relaxed_read_crc = (!write) && (!ok) && sdhi_can_read_crc_error_block(sdsts2);
        if (relaxed_read_crc)
        {
            ok = true;
        }
        if (!ok)
        {
            sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
            break;
        }

        clear_mask = ready_mask;
        if (relaxed_read_crc)
        {
            clear_mask |= SDHI_SDSTS2_READ_CRC_ERR;
        }
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U, clear_mask);

        if (!sdio_cmd53_transfer_block(write, p_sdbufr, p_data, block_size, block_index))
        {
            ok = false;
            sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
            break;
        }
    }

    if (ok)
    {
        g_cmd53_diag_stage = 3U;
        ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, &sdsts1, &sdsts2);
        if ((!ok) && (!write) && sdhi_can_accept_read_done_error(sdsts1, sdsts2))
        {
            ok = true;
        }
        if (!ok)
        {
            sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        }
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND,
                                   ok ? (sdsts2 & SDHI_SDSTS2_ERR_BITS) : 0U);
    }

    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
    }
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    if (ok)
    {
        g_cmd53_diag_stage = 0xFFU;
    }
    return ok;
}

/* Host-side CMD53: byte mode bridges to the byte primitives, block mode to the
 * block transfer. Both go through the same r_sdio_rx callback. */
static sdio_err_t sdio_rx_cmd53_callback(void * p_context, sdio_cmd53_t * p_args)
{
    bool ok;
    uint32_t r5 = 0U;

