HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    return true;
}

/* Read a region back from backplane RAM and compare with the flash source. */
static bool sdio_fw_verify_region(uint32_t bp_addr, const uint8_t * p_src, uint32_t length)
{
    uint32_t offset = 0U;
    uint32_t r5 = 0U;

    while (offset < length)
    {
        uint32_t addr = bp_addr + offset;
        uint32_t window_left = 0x8000UL - (addr & 0x7FFFUL);
        uint32_t chunk = length - offset;
        uint32_t f1_address;
        uint32_t i;

        if (chunk > 1024UL)
        {
            chunk = 1024UL;
        }
        if (chunk > window_left)
        {
            chunk = window_left;
        }
        if (chunk >= SDIO_FW_BLOCK_SIZE)
        {
            chunk &= ~(SDIO_FW_BLOCK_SIZE - 1UL);
        }

        if (SDIO_SUCCESS != R_SDIO_BrcmSetBackplaneWindow(&g_sdio_ctrl, addr, NULL, &r5))
        {
            return false;
        }
        f1_address = R_SDIO_BrcmBackplaneFunctionAddress(addr, chunk);

        if (chunk >= SDIO_FW_BLOCK_SIZE)
        {
            if (SDIO_SUCCESS != R_SDIO_Cmd53ReadBlocks(&g_sdio_ctrl, 1U, f1_address, true,
                                                       g_fw_verify, chunk / SDIO_FW_BLOCK_SIZE, &r5))
            {
                return false;
            }
        }
        else
        {
            if (SDIO_SUCCESS != R_SDIO_Cmd53ReadBytes(&g_sdio_ctrl, 1U, f1_address, true,
                                                      g_fw_verify, chunk, &r5))
            {
                return false;
            }
        }
        for (i = 0U; i < chunk; i++)
        {
            if (p_src[offset + i] != g_fw_verify[i])
            {
                return false;
            }
        }
        offset += chunk;
    }

    return true;
}

/*
 * Firmware download + boot (the de-risk gate). Stream the firmware blob into
 * SOCRAM at address 0, the NVRAM image near the top with its TOC trailer, clear
 * CHIPCLKCSR, then release the WLAN ARM core. Success = the chip comes alive:
 * HT_AVAIL (firmware brought the PLL up) and function 2 (IO_READY bit 2) ready.
 * Mirrors perf's fw_download_and_boot. Writes the HT/IOR settle times (ms).
 * The blobs must already be in flash (loaded via J-Link).
 */
bool sdio_host_fw_download_and_boot(uint32_t * p_ht_ms, uint32_t * p_ior_ms)
{
    const uint8_t * p_fw = (const uint8_t *)SDIO_FW_BLOB_ADDR;
    const uint8_t * p_nv = (const uint8_t *)SDIO_NVRAM_IMAGE_ADDR;
    const uint32_t nvram_base = 0x0007FFFCUL - SDIO_NVRAM_IMAGE_SIZE;
    const uint32_t toc = (((~(SDIO_NVRAM_IMAGE_SIZE / 4UL)) & 0xFFFFUL) << 16) |
                         ((SDIO_NVRAM_IMAGE_SIZE / 4UL) & 0xFFFFUL);
    uint32_t fw_tail = (SDIO_FW_BLOB_SIZE > 1024UL) ? (SDIO_FW_BLOB_SIZE - 1024UL) : 0UL;
    uint32_t i;
    uint8_t val = 0U;
    uint8_t readback = 0U;

    if (NULL != p_ht_ms)
    {
        *p_ht_ms = 0U;
    }
    if (NULL != p_ior_ms)
    {
        *p_ior_ms = 0U;
    }

    /* The blobs must be present in flash (0xFF == erased). */
    if ((0xFFU == p_fw[0]) || (0xFFU == p_nv[0]))
    {
        return false;
    }

    /* Terminate any in-flight F2 frame a previous run may have left (issue #25:
     * an aborted F2 write wedges every later multi-block CMD53). */
    (void)sdio_host_cmd52_write(0U, SDIO_CCCR_IO_ABORT, 2U, &readback);
    (void)sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_FRAMECTRL, 0x03U, &readback);

    /* Enable function 2. */
    if (!sdio_host_cmd52_read(0U, SDIO_CCCR_IO_ENABLE, &val) ||
        !sdio_host_cmd52_write(0U, SDIO_CCCR_IO_ENABLE, (uint8_t)(val | SDIO_CCCR_IO_ENABLE_FN2), &readback))
    {
        return false;
    }

    if (!sdio_host_socram_init())
    {
        return false;
    }

    /* Firmware -> SOCRAM 0, verify head + tail. */
    if (!sdio_fw_write_region(0UL, p_fw, SDIO_FW_BLOB_SIZE))
    {
        return false;
    }
    if (!sdio_fw_verify_region(0UL, p_fw, 1024UL) ||
        !sdio_fw_verify_region(fw_tail, p_fw + fw_tail, SDIO_FW_BLOB_SIZE - fw_tail))
    {
        return false;
    }

    /* NVRAM near the top of SOCRAM + verify, then the TOC trailer. */
    if (!sdio_fw_write_region(nvram_base, p_nv, SDIO_NVRAM_IMAGE_SIZE) ||
        !sdio_fw_verify_region(nvram_base, p_nv, SDIO_NVRAM_IMAGE_SIZE))
    {
        return false;
    }
    if (!brcm_bp_write32(0x0007FFFCUL, toc) ||
        !sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_CHIPCLKCSR, 0x00U, &readback))
    {
        return false;
    }

    /* Release the WLAN ARM core - it starts running the firmware. */
    if (!brcm_core_reset(BRCM_ARM_WRAP_BASE))
    {
        return false;
    }
    if (!brcm_bp_read8(BRCM_ARM_WRAP_BASE + BRCM_AI_IOCTRL_OFFSET, &val) ||
        (BRCM_SICF_CLOCK_EN != (val & (BRCM_SICF_FGC | BRCM_SICF_CLOCK_EN))) ||
        !brcm_bp_read8(BRCM_ARM_WRAP_BASE + BRCM_AI_RESETCTRL_OFFSET, &val) ||
        (0U != (val & BRCM_AIRC_RESET)))
    {
        return false;
    }

    /* Wait for HT (the running firmware brings the PLL up). */
    for (i = 0U; i < 2500U; i++)
    {
        if (sdio_host_cmd52_read(1U, SDIO_BRCM_FUNC1_CHIPCLKCSR, &val) &&
            (0U != (val & SDIO_BRCM_HT_AVAIL)))
        {
            break;
        }
        R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    }
    if (i >= 2500U)
    {
        return false;
    }
    if (NULL != p_ht_ms)
    {
        *p_ht_ms = i;
    }

    /* Wait for function 2 (the SDPCM data function) to be ready. */
    for (i = 0U; i < 1000U; i++)
    {
        if (sdio_host_cmd52_read(0U, SDIO_CCCR_IO_READY, &val) &&
            (0U != (val & SDIO_CCCR_IO_READY_FN2)))
        {
            break;
        }
        R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    }
    if (i >= 1000U)
    {
        return false;
    }
    if (NULL != p_ior_ms)
    {
        *p_ior_ms = i;
    }

    return true;
}

void sdio_host_cmd53_diag(uint8_t * p_stage, uint32_t * p_s1, uint32_t * p_s2, uint32_t * p_r5)
{
    if (NULL != p_stage)
    {
        *p_stage = g_cmd53_diag_stage;
    }
    if (NULL != p_s1)
    {
        *p_s1 = g_cmd53_diag_s1;
    }
    if (NULL != p_s2)
    {
        *p_s2 = g_cmd53_diag_s2;
    }
    if (NULL != p_r5)
    {
        *p_r5 = g_cmd53_diag_r5;
    }
}

void sdio_host_cmd53_diag_ext(uint8_t * p_stage, uint32_t * p_s1, uint32_t * p_s2,
                              uint32_t * p_er1, uint32_t * p_er2,
                              uint32_t * p_r5, uint32_t * p_data0)
{
    sdio_host_cmd53_diag(p_stage, p_s1, p_s2, p_r5);
    if (NULL != p_er1)
    {
        *p_er1 = g_cmd53_diag_er1;
    }
    if (NULL != p_er2)
    {
        *p_er2 = g_cmd53_diag_er2;
    }
    if (NULL != p_data0)
    {
        *p_data0 = g_cmd53_diag_data0;
    }
}
